STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA55CG/Applications/BLE/BLE_HeartRateThreadX/STM32_WPAN/App/app_ble.c
  /* De-initialize BLE related modules */
  BAES_Reset( );
  PKACTRL_Reset();
  BLE_TIMER_Deinit();

  tListNode *listNodeRemoved;

  /* Free all the Asynchronous Event queue nodes */
  while(LST_is_empty(&BleAsynchEventQueue) != TRUE)
  {
    LST_remove_tail(&BleAsynchEventQueue, &listNodeRemoved);
    (void)AMM_Free((uint32_t *)listNodeRemoved);
  }

  /* Delete BLE Host stack ThreadX objects */
  /* Only delete semaphore if it was successfully created: check its internal ID */
  if (BleHostSemaphore.tx_semaphore_id == TX_SEMAPHORE_ID)
  {
    LOG_INFO_APP("Deleting semaphore %s, status : ",BleHostSemaphore.tx_semaphore_name);
    if (tx_semaphore_delete(&BleHostSemaphore) != TX_SUCCESS)
    {
      LOG_INFO_APP("FAILED\n");
      Error_Handler();
    }
    else
    {
      LOG_INFO_APP("SUCCESS\n");
    }
  }

  /* Only delete semaphore if it was successfully created: check its internal ID */
  if (HciAsyncEvtSemaphore.tx_semaphore_id == TX_SEMAPHORE_ID)
  {
    LOG_INFO_APP("Deleting semaphore %s, status : ",HciAsyncEvtSemaphore.tx_semaphore_name);
    if (tx_semaphore_delete(&HciAsyncEvtSemaphore) != TX_SUCCESS)
    {
      LOG_INFO_APP("FAILED\n");
      Error_Handler();
    }
    else
    {
      LOG_INFO_APP("SUCCESS\n");
    }
  }

  /* Only delete semaphore if it was successfully created */
  if (GapProcCompleteSemaphore.tx_semaphore_id == TX_SEMAPHORE_ID)
  {
    LOG_INFO_APP("Deleting semaphore %s, status : ",GapProcCompleteSemaphore.tx_semaphore_name);
    if (tx_semaphore_delete(&GapProcCompleteSemaphore) != TX_SUCCESS)
    {
      LOG_INFO_APP("FAILED\n");
      Error_Handler();
    }
    else
    {
      LOG_INFO_APP("SUCCESS\n");
    }
  }

  /* Terminate then delete the thread only if created */
  if (BleHostTaskHandle.tx_thread_id == TX_THREAD_ID)
  {
    LOG_INFO_APP("Terminating and Deleting thread %s, status : ",BleHostTaskHandle.tx_thread_name);
    if (tx_thread_terminate(&BleHostTaskHandle) != TX_SUCCESS)
    {
      LOG_INFO_APP("FAILED\n");
      Error_Handler();
    }
    else
    {
      if (tx_thread_delete(&BleHostTaskHandle) != TX_SUCCESS)
      {
        LOG_INFO_APP("FAILED\n");
        Error_Handler();
      }
      else
      {
        LOG_INFO_APP("SUCCESS\n");
      }
    }
  }

  /* Terminate then delete the thread only if created (ID matches) */
  if (HciAsyncEvtTaskHandle.tx_thread_id == TX_THREAD_ID)
  {
    LOG_INFO_APP("Terminating and Deleting thread %s, status : ",HciAsyncEvtTaskHandle.tx_thread_name);
    if (tx_thread_terminate(&HciAsyncEvtTaskHandle) != TX_SUCCESS)
    {
      LOG_INFO_APP("FAILED\n");
      Error_Handler();
    }
    else
    {
      if (tx_thread_delete(&HciAsyncEvtTaskHandle) != TX_SUCCESS)
      {
        LOG_INFO_APP("FAILED\n");
        Error_Handler();
      }
      else
      {
        LOG_INFO_APP("SUCCESS\n");
      }
    }
  }

  /* Release the allocated memory if present */
  if (BleHostStack_p != NULL)
  {
    if (tx_byte_release(BleHostStack_p) != TX_SUCCESS)
    {
      LOG_INFO_APP("BLE Host memory release FAILED\n");
      Error_Handler();
    }
    else
    {
      LOG_INFO_APP("BLE Host memory release SUCCESS\n");
      BleHostStack_p = NULL;
    }
  }

  /* USER CODE BEGIN APP_BLE_Deinit_2 */

  /* USER CODE END APP_BLE_Deinit_2 */
  return;
}

SVCCTL_UserEvtFlowStatus_t SVCCTL_App_Notification(void *p_Pckt)
{
  tBleStatus ret = BLE_STATUS_ERROR;
  hci_event_pckt    *p_event_pckt;
  evt_le_meta_event *p_meta_evt;
  evt_blecore_aci   *p_blecore_evt;

  p_event_pckt = (hci_event_pckt*) ((hci_uart_pckt *) p_Pckt)->data;
  UNUSED(ret);
  /* USER CODE BEGIN SVCCTL_App_Notification */

  /* USER CODE END SVCCTL_App_Notification */

  switch (p_event_pckt->evt)
  {
    case HCI_DISCONNECTION_COMPLETE_EVT_CODE:
    {
      hci_disconnection_complete_event_rp0 *p_disconnection_complete_event;
      p_disconnection_complete_event = (hci_disconnection_complete_event_rp0 *) p_event_pckt->data;
      if (p_disconnection_complete_event->Connection_Handle == bleAppContext.connectionHandle)
      {
        bleAppContext.connectionHandle = 0xFFFF;
        bleAppContext.Device_Connection_Status = APP_BLE_IDLE;
        LOG_INFO_APP(">>== HCI_DISCONNECTION_COMPLETE_EVT_CODE\n");
        LOG_INFO_APP("     - Connection Handle:   0x%04X\n     - Reason:    0x%02X\n",
                    p_disconnection_complete_event->Connection_Handle,
                    p_disconnection_complete_event->Reason);

        /* USER CODE BEGIN EVT_DISCONN_COMPLETE_2 */

        /* USER CODE END EVT_DISCONN_COMPLETE_2 */
      }
      gap_cmd_resp_release();

      /* USER CODE BEGIN EVT_DISCONN_COMPLETE_1 */

      /* USER CODE END EVT_DISCONN_COMPLETE_1 */
      HRSHandleNotification.EvtOpcode = HRS_DISCON_HANDLE_EVT;
      DISHandleNotification.EvtOpcode = DIS_DISCON_HANDLE_EVT;
      HRSHandleNotification.ConnectionHandle = p_disconnection_complete_event->Connection_Handle;
      DISHandleNotification.ConnectionHandle = p_disconnection_complete_event->Connection_Handle;
      HRS_APP_EvtRx(&HRSHandleNotification);
      DIS_APP_EvtRx(&DISHandleNotification);
      /* USER CODE BEGIN EVT_DISCONN_COMPLETE */
      ULONG adv_cmd = 0;
      tx_queue_send(&ADV_Queue, &adv_cmd, TX_NO_WAIT);

      /* USER CODE END EVT_DISCONN_COMPLETE */
      break; /* HCI_DISCONNECTION_COMPLETE_EVT_CODE */
    }
    case HCI_HARDWARE_ERROR_EVT_CODE:
    {
       hci_hardware_error_event_rp0 *p_hardware_error_event;

       p_hardware_error_event = (hci_hardware_error_event_rp0 *)p_event_pckt->data;
       UNUSED(p_hardware_error_event);
       LOG_INFO_APP(">>== HCI_HARDWARE_ERROR_EVT_CODE\n");
       LOG_INFO_APP("Hardware Code = 0x%02X\n",p_hardware_error_event->Hardware_Code);
       /* USER CODE BEGIN HCI_EVT_LE_HARDWARE_ERROR */

       /* USER CODE END HCI_EVT_LE_HARDWARE_ERROR */
       break; /* HCI_HARDWARE_ERROR_EVT_CODE */
    }
    case HCI_LE_META_EVT_CODE:
    {
      p_meta_evt = (evt_le_meta_event*) p_event_pckt->data;
      /* USER CODE BEGIN EVT_LE_META_EVENT */

      /* USER CODE END EVT_LE_META_EVENT */
      switch (p_meta_evt->subevent)
      {
        case HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE:
        {
          uint32_t conn_interval_us = 0;
          hci_le_connection_update_complete_event_rp0 *p_conn_update_complete;
          p_conn_update_complete = (hci_le_connection_update_complete_event_rp0 *) p_meta_evt->data;
          conn_interval_us = p_conn_update_complete->Conn_Interval * 1250;
          LOG_INFO_APP(">>== HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE\n");
          LOG_INFO_APP("     - Connection Interval:   %d.%02d ms\n     - Connection latency:    %d\n     - Supervision Timeout:   %d ms\n     - Status:                0x%02X\n",
                       conn_interval_us / 1000,
                       (conn_interval_us%1000) / 10,
                       p_conn_update_complete->Conn_Latency,
                       p_conn_update_complete->Supervision_Timeout*10,
                       p_conn_update_complete->Status);
          UNUSED(conn_interval_us);
          UNUSED(p_conn_update_complete);

